; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=50, out_folder=htg/blocksworld/training, instance_id=30, seed=2054, goal_proportion=0.1

(define (problem blocksworld-30)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 - object)
 (:init 
    (arm-empty)
    (clear b4)
    (on b4 b31)
    (on-table b31)
    (clear b33)
    (on b33 b41)
    (on b41 b26)
    (on-table b26)
    (clear b29)
    (on b29 b48)
    (on-table b48)
    (clear b28)
    (on-table b28)
    (clear b49)
    (on b49 b12)
    (on b12 b7)
    (on b7 b45)
    (on-table b45)
    (clear b9)
    (on b9 b3)
    (on b3 b13)
    (on-table b13)
    (clear b21)
    (on-table b21)
    (clear b19)
    (on b19 b38)
    (on b38 b25)
    (on b25 b18)
    (on b18 b37)
    (on b37 b42)
    (on b42 b44)
    (on-table b44)
    (clear b43)
    (on b43 b5)
    (on-table b5)
    (clear b6)
    (on-table b6)
    (clear b17)
    (on b17 b32)
    (on b32 b30)
    (on-table b30)
    (clear b22)
    (on-table b22)
    (clear b10)
    (on b10 b27)
    (on-table b27)
    (clear b1)
    (on-table b1)
    (clear b40)
    (on b40 b39)
    (on b39 b2)
    (on b2 b47)
    (on b47 b16)
    (on b16 b34)
    (on b34 b11)
    (on b11 b24)
    (on b24 b50)
    (on b50 b15)
    (on-table b15)
    (clear b36)
    (on b36 b20)
    (on b20 b46)
    (on-table b46)
    (clear b23)
    (on b23 b8)
    (on-table b8)
    (clear b35)
    (on b35 b14)
    (on-table b14))
 (:goal  (and 
    (clear b4)
    (on-table b4)
    (clear b2)
    (on b2 b1)
    (on b1 b5)
    (on-table b5)
    (clear b3)
    (on-table b3))))

; plan
1. (unstack b9 b3)
   deleted: (on b9 b3) (clear b9) (arm-empty)
   added: (holding b9) (clear b3)
   goals met: 3 of 8
2. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 3 of 8
3. (unstack b3 b13)
   deleted: (on b3 b13) (clear b3) (arm-empty)
   added: (holding b3) (clear b13)
   goals met: 2 of 8
4. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 4 of 8
5. (unstack b4 b31)
   deleted: (on b4 b31) (clear b4) (arm-empty)
   added: (holding b4) (clear b31)
   goals met: 3 of 8
6. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 5 of 8
7. (unstack b40 b39)
   deleted: (on b40 b39) (clear b40) (arm-empty)
   added: (holding b40) (clear b39)
   goals met: 5 of 8
8. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 5 of 8
9. (unstack b39 b2)
   deleted: (on b39 b2) (clear b39) (arm-empty)
   added: (holding b39) (clear b2)
   goals met: 6 of 8
10. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 6 of 8
11. (unstack b2 b47)
   deleted: (on b2 b47) (clear b2) (arm-empty)
   added: (holding b2) (clear b47)
   goals met: 5 of 8
12. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 7 of 8
13. (unstack b43 b5)
   deleted: (on b43 b5) (clear b43) (arm-empty)
   added: (holding b43) (clear b5)
   goals met: 7 of 8
14. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 7 of 8
15. (unstack b2 b1)
   deleted: (on b2 b1) (clear b2) (arm-empty)
   added: (holding b2) (clear b1)
   goals met: 5 of 8
16. (stack b2 b47)
   deleted: (clear b47) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b47)
   goals met: 6 of 8
17. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 6 of 8
18. (stack b1 b5)
   deleted: (clear b5) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b5)
   goals met: 7 of 8
19. (unstack b2 b47)
   deleted: (on b2 b47) (clear b2) (arm-empty)
   added: (holding b2) (clear b47)
   goals met: 6 of 8
20. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 8 of 8
